doc/developer/document_history_using_rcs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>document_history_using_rcs</title>
<!-- 2014-04-26 Sat 14:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Nagarjuna" />
</head>
<body>
<div id="content">
<h1 class="title">document_history_using_rcs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Version Control of Resources Using Revision Control System (RCS)</a>
<ul>
<li><a href="#sec-1-1">1.1. Create RCS repository</a></li>
<li><a href="#sec-1-2">1.2. Create/Overwrite a json-file of a document</a></li>
<li><a href="#sec-1-3">1.3. Insert a new document &#x2013; checkin()</a></li>
<li><a href="#sec-1-4">1.4. Update a document &#x2013; checkout(), update json-file and then checkin()</a></li>
<li><a href="#sec-1-5">1.5. Difference between two revisions(history) of a json-file &#x2013; using diff()</a></li>
<li><a href="#sec-1-6">1.6. Code-snippet: Implementing all above functionalities together</a></li>
<li><a href="#sec-1-7">1.7. Creating json-file for the newly inserted document</a></li>
<li><a href="#sec-1-8">1.8. Initial Check-in</a></li>
<li><a href="#sec-1-9">1.9. Update - Storing history - Check-out, update file &amp; Check-in</a></li>
<li><a href="#sec-1-10">1.10. Difference between two versions &#x2013; diff() that implemets rcsdiff()</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Version Control of Resources Using Revision Control System (RCS)</h2>
<div class="outline-text-2" id="text-1">
<p>
RCS is a freely available file revision control system that can be used 
to coordinate groups of people working on common files as well as by 
yourself alone in your own private projects. It allows you to:
</p>

<ol class="org-ol">
<li>get easy access to the latest version of a file that is being worked 
on by many people;
</li>
<li>get easy access to all previous version of files to

<ul class="org-ul">
<li>undo unfortunate modifications,
</li>
<li>reconstruct the source code of old released file versions; 
</li>
</ul>
</li>

<li>get easy access to a list of changes (diff) that have been made by 
various people to your files
</li>
<li>avoid that two people independently make non-causal changes at the 
same time on the latest version of a file and thereby create two 
different latest versions. 
</li>
</ol>

<p>
RCS consists of the four frequently used shell commands ci, co, rlog, 
and rcsdiff, as well as of the rarely needed commands rcs, ident, 
rcsclean, and rcsmerge.
</p>

<p>
Read man rcsintro now to get a quick overview of the system.
</p>

<p>
Refer follwoing link:
</p>

<ol class="org-ol">
<li>RCS Tutorial &#x2013; <a href="http://oreilly.com/perl/excerpts/system-admin-with-perl/five-minute-rcs-tutorial.html#common_rcs_operations">http://oreilly.com/perl/excerpts/system-admin-with-perl/five-minute-rcs-tutorial.html#common_rcs_operations</a>"
</li>
</ol>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Create RCS repository</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Run the following command: "python manage.py initrcsrepo"
</li>

<li>Necessary code to look out for:
</li>

<li>In settings.py file

<ul class="org-ul">
<li>VERSIONING_COLLECTION: list of collection-names whose 
documents' history needs to be maintained
</li>
<li>RCS_REPO_DIR : absolute filesystem path to the directory that
will hold all rcs-files (history-files corresponding to every 
json-file created for each document) 
</li>
<li>RCS_REPO_DIR_HASH_LEVEL : indicates the "hash-level-number", 
i.e the number of sub-directories that will be created for 
the corresponding document under it's collection-directory; 
in order to store json-files in an effective manner 
</li>

<li>In models.py file
<ul class="org-ul">
<li>create_rcs_repo_collections() : Function of HistoryManager 
class that creates RCS(named as 'rcs-repo') repository along with 
sub-directories for each collection inside it
</li>
</ul>
</li>

<li>In initrcsrepo.py file

<ul class="org-ul">
<li>Command class : It consists of call to the above specified 
create_rcs_repo_collections() function accepting 
VERSIONING_COLLECTION as an argument; which gets executed on 
execution of the above specified command(Step 1.).
</li>
</ul>
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Create/Overwrite a json-file of a document</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>create_or_replace_json_file() : Function of HistoryManager 
class that creates/overwrites a json-file for passed document object in 
its respective hashed-directory structure.
</li>

<li>Code-snippet
</li>
</ol>

<pre class="example">
history_manager  HistoryManager()

if not history_manager.create_or_replace_json_file(&lt;collection-document-object&gt;):
    &lt;collection-object&gt;.remove({'_id': &lt;collection-document-object&gt;._id})
</pre>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Insert a new document &#x2013; checkin()</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>While inserting a new document, follow the following sequence:
</li>

<li>Insert document &#x2013; using save() mongokit function,

<ol class="org-ol">
<li>Call checkin() function of RCS class from rcslib.py file
</li>
</ol>
</li>

<li>Syntax:

<ol class="org-ol">
<li>&lt;collection-object&gt;.save()
</li>

<li>RCS().checkin(&lt;file-path&gt;[, 1[, 'desc-message'[, '-i']]])
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Update a document &#x2013; checkout(), update json-file and then checkin()</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>While updating a document, follow the following sequence:

<ol class="org-ol">
<li>Update document &#x2013; using update() mongokit function,
</li>
<li>Call checkout() function of RCS class from rcslib.py file,
</li>
<li>Update file &#x2013; using create_or_replace_json_file(), and
</li>
<li>Call checkin() function.
</li>
</ol>
</li>

<li>Syntax:

<ol class="org-ol">
<li>&lt;collection-object&gt;.update(&#x2026;)
</li>
<li>RCS().checkout(&lt;file-path&gt;)
</li>
<li>HistoryManager().create_or_replace_json_file(&lt;collection-document-object&gt;)
</li>
<li>RCS().checkin(&lt;file-path&gt;[, 'commit-message'[, 'other-options']])
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Difference between two revisions(history) of a json-file &#x2013; using diff()</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Call diff() function of RCS class from rcslib.py file
</li>

<li>Syntax: RCS().diff(&lt;file-path&gt;[, &lt;rev-1&gt;[, &lt;rev-2]])
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Code-snippet: Implementing all above functionalities together</h3>
<div class="outline-text-3" id="text-1-6">
<pre class="example">
from gXnowsys_ndf.ndf.models import *
from bson import ObjectId
from django_mongokit import get_database

db  get_database()
c_aut = db[Author.collection_name]

o_aut = c_aut.Author()
o_aut.username = u"demo_username"
o_aut.password = u"demo_password"
_aut.save()
{u'_id': ObjectId('525e5b6ac76db10c810c6c20'),
u'address': None,
u'created_at': datetime.datetime(2013, 10, 16, 14, 54, 38, 17000),
u'email': None,
u'first_name': None,
u'is_active': None,
u'is_staff': None,
u'is_superuser': None,
u'last_login': None,
u'last_name': None,
u'password': u'demo_password',
u'phone': None,
u'username': u'demo_username'}
</pre>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Creating json-file for the newly inserted document</h3>
<div class="outline-text-3" id="text-1-7">
<pre class="example">
hm = HistoryManager()

if not hm.create_or_replace_json_file(o_aut):
     c_aut.remove({'_id': o_aut._id})
</pre>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Initial Check-in</h3>
<div class="outline-text-3" id="text-1-8">
<pre class="example">
cur_aut = c_aut.Author.find()
objid = cur_aut[0]._id

from gnowsys_ndf.ndf.rcslib import RCS

rcsobj = RCS()

fp = hm.get_file_path(c_aut.Author.one({'_id': objid}))

rcsobj.checkin(fp, 1, "Descriptive-message...", "-i")
</pre>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Update - Storing history - Check-out, update file &amp; Check-in</h3>
<div class="outline-text-3" id="text-1-9">
<pre class="example">
============== 1ST UPDATE ====================

fp = hm.get_file_path(c_aut.Author.one({'_id': objid}))

fp
'.../gnowsys_ndf/ndf/static/rcs-repo/Authors/0/2/6/525e5b6ac76db10c810c6c20.json'

c_aut.update({'_id': objid}, {'$set': {'username': u'un_2', 'password': u'pwd_2'}})
{u'connectionId': 1,
u'err': None,
u'n': 1,
u'ok': 1.0,
u'updatedExisting': True}
</pre>

<p>
NOTE: After update, re-retrieve the object from the database-collection; otherwise your json-file won't get updated. Because the instance refers to (or holds) the document instance that was referring to before update command was executed, and the json-file gets created based on the document-instance that is passed to create_or_replace_json_file() function. Hence, must do the same.
</p>
<pre class="example">
c_aut.Author.one({'_id': objid})
{u'_id': ObjectId('525e5b6ac76db10c810c6c20'),
u'address': None,
u'created_at': datetime.datetime(2013, 10, 16, 14, 54, 38, 17000),
u'email': None,
u'first_name': None,
u'is_active': None,
u'is_staff': None,
u'is_superuser': None,
u'last_login': None,
u'last_name': None,
u'password': u'pwd_2',
u'phone': None,
u'username': u'un_2'}

hm.create_or_replace_json_file(c_aut.Author.one({'_id': objid}))

rcsobj.checkin(fp, 1, 'Added -- _2')
</pre>

<pre class="example">
============== 2ND UPDATE ====================


c_aut.update({'_id': objid}, {'$unset': {'address': u''}})
{u'connectionId': 1,
u'err': None,
u'n': 1,
u'ok': 1.0,
u'updatedExisting': True}

c_aut.Author.one({'_id': objid})
{u'_id': ObjectId('525e5b6ac76db10c810c6c20'),
u'created_at': datetime.datetime(2013, 10, 16, 14, 54, 38, 17000),
u'email': None,
u'first_name': None,
u'is_active': None,
u'is_staff': None,
u'is_superuser': None,
u'last_login': None,
u'last_name': None,
u'password': u'pwd_2',
u'phone': None,
u'username': u'un_2'}

rcsobj.checkout(fp)

hm.create_or_replace_json_file(c_aut.Author.one({'_id': objid}))

rcsobj.checkin(fp, 1, 'Deleted (note: here, element not value)-- address')
</pre>


<pre class="example">
============== 3RD UPDATE ====================

c_aut.update({'_id': objid}, {'$set': {'address': None}})
{u'connectionId': 1,
u'err': None,
u'n': 1,
u'ok': 1.0,
u'updatedExisting': True}

c_aut.Author.one({'_id': objid})
{u'_id': ObjectId('525e5b6ac76db10c810c6c20'),
u'address': None,
u'created_at': datetime.datetime(2013, 10, 16, 14, 54, 38, 17000),
u'email': None,
u'first_name': None,
u'is_active': None,
u'is_staff': None,
u'is_superuser': None,
u'last_login': None,
u'last_name': None,
u'password': u'pwd_2',
u'phone': None,
u'username': u'un_2'}

rcsobj.checkout(fp)

hm.create_or_replace_json_file(c_aut.Author.one({'_id': objid}))

rcsobj.checkin(fp, 1, 'Added (note: here, element not value)-- address')
</pre>

<pre class="example">
============== 4TH UPDATE ====================

c_aut.update({'_id': objid}, {'$set': {'address': u'address_new'}})
{u'connectionId': 1,
u'err': None,
u'n': 1,
u'ok': 1.0,
u'updatedExisting': True}

c_aut.Author.one({'_id': objid})
{u'_id': ObjectId('525e5b6ac76db10c810c6c20'),
u'address': u'address_new',
u'created_at': datetime.datetime(2013, 10, 16, 14, 54, 38, 17000),
u'email': None,
u'first_name': None,
u'is_active': None,
u'is_staff': None,
u'is_superuser': None,
u'last_login': None,
u'last_name': None,
u'password': u'pwd_2',
u'phone': None,
u'username': u'un_2'}

rcsobj.checkout(fp)

hm.create_or_replace_json_file(c_aut.Author.one({'_id': objid}))

rcsobj.checkin(fp, 1, 'Added -- address_new')
</pre>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Difference between two versions &#x2013; diff() that implemets rcsdiff()</h3>
<div class="outline-text-3" id="text-1-10">
<pre class="example">
   ============== 1ST DIFF ====================
   
   rcsobj.diff(fp)
   ===================================================================
   RCS file: /home/avadoot/Desktop/Tissproject/TP_MK/gstudio/gnowsys-ndf/gnowsys_ndf/ndf/static/rcs-repo/Authors/0/2/6/525e5b6ac76db10c810c6c20.json,v
   retrieving revision 1.5
   retrieving revision 1.4
   diff -r1.5 -r1.4
   
   Actual O/P returned: '5c5\n&lt;     "address": "address_new",\n---\n&gt;     "address": null,\n'
   
   After formatting: 
   5c5
   &lt;     "address": "address_new",
   ---
   &gt;     "address": null,
   
#+END_EXAMPLE X  

#+BEGIN_EXAMPLE


   ============== 2ND DIFF ====================
   
   rcsobj.diff(fp, '1.5', '1.4')
   ===================================================================
   RCS file: /home/avadoot/Desktop/Tissproject/TP_MK/gstudio/gnowsys-ndf/gnowsys_ndf/ndf/static/rcs-repo/Authors/0/2/6/525e5b6ac76db10c810c6c20.json,v
   retrieving revision 1.5
   retrieving revision 1.4
   diff -r1.5 -r1.4
   
   Actual O/P returned: '5c5\n&lt;     "address": "address_new",\n---\n&gt;     "address": null,\n'
   
   After formatting: 
   5c5
   &lt;     "address": "address_new",
   ---
   &gt;     "address": null,
</pre>


<pre class="example">
============== 3RD DIFF ====================

rcsobj.diff(fp, '1.5', '1.3')
===================================================================
RCS file: /home/avadoot/Desktop/Tissproject/TP_MK/gstudio/gnowsys-ndf/gnowsys_ndf/ndf/static/rcs-repo/Authors/0/2/6/525e5b6ac76db10c810c6c20.json,v
retrieving revision 1.5
retrieving revision 1.3
diff -r1.5 -r1.3

Actual O/P returned: '5d4\n&lt;     "address": "address_new",\n'

After formatting: 
5d4
&lt;     "address": "address_new",
</pre>


<pre class="example">
============== 4TH DIFF ====================

rcsobj.diff(fp, '1.2', '1.4')
===================================================================
RCS file: /home/avadoot/Desktop/Tissproject/TP_MK/gstudio/gnowsys-ndf/gnowsys_ndf/ndf/static/rcs-repo/Authors/0/2/6/525e5b6ac76db10c810c6c20.json,v
retrieving revision 1.2
retrieving revision 1.4
diff -r1.2 -r1.4
</pre>

<p>
Actual O/P returned: ''
</p>

<p>
After formatting: Nothing returned as there is no difference.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
